Autodesk.Revit.DB.DividedPath.IsIntersectorValidForDividedPath(Autodesk.Revit.DB.ElementId)
This returns true if the intersector is an element that can be used to intersect with the divided path.
Remarks:
Intersectors can be curve elements, datum planes, or other divided paths.
Note that divided paths that have this divided path as an intersector
(either directly, or recursively) are not valid.
Also, if the nesting of divided path intersectors that have intersectors is more than 5 levels deep
the divided path intersector is considered invalid as well.
intersector:
The intersector.
Returns:
True if the reference can be used to create a divided path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DividedPath.SetIntersectingElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set the elements whose intersection with path produces points.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not all intersecting elements in intersectors are valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DividedPath.IsIntersectorValidForCreation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
This returns true if the intersector is an element that can be used to intersect with a newly created divided path.
Remarks:
Intersectors can be curve elements, datum planes, or divided paths.
This function is should not be used to validate the input to SetIntersectors()
because it does not check for self intersection of any other circular dependencies between intersectors.
Use isIntersectorValidForDividedPath() instead.
document:
The document.
intersector:
The intersector.
Returns:
True if the reference can be used to create a divided path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DividedPath.AreCurveReferencesConnected(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
This checks if the references represent a connected set of curves as required by the divided path.
document:
The document.
curveReferences:
The references.
Returns:
True if the arguments passed the checks, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DividedPath.IsCurveReferenceValid(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
This returns true if the reference represents a curve or edge that can be used to create a divided path.
document:
The document.
curveReference:
The reference.
Returns:
True if the reference can be used to create a divided path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DividedPath.SeparateReferencesIntoConnectedReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
This function separates the input curve references into groups of connected curve references.
Each group of connected curve references can be used to create a divided path.
document:
The document.
curveReferences:
The references.
Returns:
The grouped references
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not all curve references in curveReferences represent a curve or an edge
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2013

Autodesk.Revit.DB.DividedPath.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Creates a new instance of a divided path whose points are determined by the intersecting elements.
Remarks:
Intersectors can be curve elements, datum planes, or other divided paths.
document:
The document.
curveReferences:
References that represent a connected set of curves or edges.
intersectors:
Elements whose intersection with the curve references result in additional divisions.
Returns:
The newly created divided path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a divided path.
-or-
Not all curve references in curveReferences represent a curve or an edge
-or-
The references in curveReferences are not connected.
-or-
Not all intersecting elements in intersectors are valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.DividedPath.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Creates a new instance of a divided path with a default layout.
document:
The document.
curveReferences:
References that represent a connected set of curves or edges.
Returns:
The newly created divided path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a divided path.
-or-
Not all curve references in curveReferences represent a curve or an edge
-or-
The references in curveReferences are not connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013